In [44]:
people = {
"first": ["Corey", 'Jane', 'John'],
"last": ["Schafer", 'Doe', 'Doe'],
"email": ["CoreyMSchafer@gmail.com", 'Jane Doe@email.com', 'JohnDoe@email.com']
}

In [45]:
import pandas as pd

In [46]:
df1=pd.DataFrame(people)

In [47]:
df1

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe       Jane Doe@email.com
2   John      Doe        JohnDoe@email.com

In [48]:
#Add/Remove Rows and Columns
df1['full_name']=(df1['first']+' '+df1['last'])

In [49]:
df1

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe       Jane Doe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [50]:
#Remove Rows
df1.drop(columns=['first','last'],inplace=True)

In [51]:
df1

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1       Jane Doe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [52]:
#String Split
df1['full_name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [53]:
#Added the previous values also in it
df1[['first','last']]=df['full_name'].str.split(' ',expand=True)

In [55]:
df1

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       Jane Doe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [56]:
#Adding and removing rows of data using ignore_index
df1.append({'first': 'Tony'},ignore_index=True)

C:\Users\jaiad\AppData\Local\Temp\ipykernel_27496\1259549274.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append({'first': 'Tony'},ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       Jane Doe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [57]:
#Created a new Data Frame
people = {
"first": ["Tony", 'Steve'],
"last": ["Stark", 'Rogers'],
"email": ["ironman@avenger.com", 'cap@avenger.com']
}
df2=pd.DataFrame(people)

In [58]:
df2

   first    last                email
0   Tony   Stark  ironman@avenger.com
1  Steve  Rogers      cap@avenger.com

In [66]:
#Merging two DataFrame if u Give the ignore_index to true we get error in order to override it we instead  

result = pd.concat([df1, df2], ignore_index=True, sort=False)

In [74]:
result

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       Jane Doe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3      ironman@avenger.com            NaN   Tony    Stark
4          cap@avenger.com            NaN  Steve   Rogers

In [75]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       Jane Doe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3      ironman@avenger.com            NaN   Tony    Stark
4          cap@avenger.com            NaN  Steve   Rogers
5      ironman@avenger.com            NaN   Tony    Stark
6          cap@avenger.com            NaN  Steve   Rogers

In [81]:
#Droping(or) deleting rows
df.drop(index=[5,6],inplace=True)

In [82]:
df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1       Jane Doe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3      ironman@avenger.com            NaN   Tony    Stark

In [90]:
#Deleting the rows using the filter statements
filt=df['last']=='Doe'
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3      ironman@avenger.com            NaN   Tony    Stark
4          cap@avenger.com            NaN  Steve   Rogers